# 5章 pandas入門

# 5.1 pandasのデータ構造
# 5.1.1 Series
* シリーズは１次元の配列のようなオブジェクト

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
obj = Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [8]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

In [10]:
obj2[['a', 'b', 'c']]

a   -5
b    7
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [14]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
# pythonのディクショナリ形式のデータがある場合には、それを使ってSeries形式のデータを作成できる
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [16]:
# Seriesに変換するときに、indexを指定できる
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [17]:
# 欠損値
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [19]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [20]:
obj3 + obj4
# 欠損値のある計算はNanになるんだね

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [21]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [22]:
# index は後から代入して変更できる
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [23]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
       'year':[2000, 2001, 2002, 2001, 2002], 
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [24]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [25]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                  index = ['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [26]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [28]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [29]:
frame2.debt = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [30]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [31]:
pop = {'Nevada':{2001:2.4, 2002:2.9}, 
      'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [32]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [33]:
frame3.Ohio[:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [34]:
frame3.Nevada[:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [35]:
pdata = {'Ohio':frame3.Ohio[:-1], 
        'Nevada':frame3.Nevada[:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [36]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

### 5.1.3 indexオブジェクト

In [37]:
obj = Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [38]:
index[1]

'b'

In [39]:
# indexオブジェクトは変更できない！
index[1] = 'd'

TypeError: Indexes does not support mutable operations

## 5.2 pandasの重要な機能
### 5.2.1 再インデックス付け

In [40]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [41]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [42]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [43]:
# 時系列データなどでの穴埋めができる
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [44]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], 
                 columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [45]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [48]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states, fill_value=0)

   Texas  Utah  California
a      1     0           2
c      4     0           5
d      7     0           8

In [49]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', 
             columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 5.2.2 軸から要素を削除する

In [50]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [51]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [52]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [53]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [54]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [56]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 5.2.3 index参照、選択、フィルタリング

In [57]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: float64

In [58]:
obj[2:4] # indexの番号で参照するときは、上限値を含まない

c    2
d    3
dtype: float64

In [59]:
obj['b':'d'] # indexの値で参照するときは、上限値を含む

b    1
c    2
d    3
dtype: float64

In [60]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data[['two', 'four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [62]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [64]:
data > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [65]:
data[data > 5] = 0

In [66]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      0     0
Utah        0    0      0     0
New York    0    0      0     0

In [69]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [70]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

### 算術とデータの整形

In [71]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [72]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [73]:
s1+s2 # 指定されていないindexの値はNaNになるので、Nanの計算はNaNになる

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [74]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), 
                index = ['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [75]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [76]:
df1+df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [77]:
list('bcd')

['b', 'c', 'd']

#### 5.2.4.1 算術メソッドと値の置換

In [78]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [79]:
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [80]:
df1+df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [81]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [82]:
df2.add(df1, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

#### 5.2.4.2 データフレームとシリーズでの演算

In [83]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [84]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [85]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [86]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [88]:
series = frame.ix[0]
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [89]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [90]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [91]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [92]:
# 列方向に演算するには,算術用のメソッドを使う
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [93]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [95]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### 5.2.5 関数の運用とマッピング

In [96]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), 
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.786383  0.169337  0.255002
Ohio   -0.502339  0.525985 -2.084620
Texas  -0.133852  0.926084 -1.230887
Oregon -1.923481  1.605419  0.533507

In [97]:
np.abs(frame)

               b         d         e
Utah    0.786383  0.169337  0.255002
Ohio    0.502339  0.525985  2.084620
Texas   0.133852  0.926084  1.230887
Oregon  1.923481  1.605419  0.533507

In [98]:
f = lambda x: x.max() - x.min()

In [99]:
frame.apply(f)

b    2.709864
d    1.436082
e    2.618127
dtype: float64

In [100]:
frame.apply(f, axis=1)

Utah      0.617046
Ohio      2.610605
Texas     2.156971
Oregon    3.528899
dtype: float64

In [101]:
format = lambda x: '%.2f' % x

In [102]:
frame.applymap(format)

            b     d      e
Utah     0.79  0.17   0.26
Ohio    -0.50  0.53  -2.08
Texas   -0.13  0.93  -1.23
Oregon  -1.92  1.61   0.53

### 5.2.6 ソートとランク

In [106]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], 
                columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [108]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [109]:
# 軸ごとにソートできる
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [110]:
# 降順
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [111]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [112]:
# 値でのソート
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [114]:
frame = DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [115]:
# 複数の列でソートするには、列の名前をリストで渡す
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [116]:
# 値のランク
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [117]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [118]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [119]:
frame = DataFrame({'b':[4.3, 7, -3, 2], 'a':[0, 1, 0, 1], 'c':[-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [120]:
# DataFrameの場合、方向を選択してランクを計算
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [121]:
frame.rank(axis=0)

     a  b  c
0  1.5  3  2
1  3.5  4  3
2  1.5  1  4
3  3.5  2  1

### 5.2.7 重複した値を持つ軸のindex

In [122]:
# indexは一意である必要はない
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [125]:
# indexが一意であるか確認できる
obj.index.is_unique

False

In [126]:
obj['a']

a    0
a    1
dtype: int64

In [128]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.359858  0.401199  1.307002
a -1.492761  0.569485  0.106923
b -1.293695 -0.628056 -0.674183
b -0.523678 -0.390106  0.676932

In [129]:
df.ix['b']

          0         1         2
b -1.293695 -0.628056 -0.674183
b -0.523678 -0.390106  0.676932

## 5.3 要約統計量の集計と計算

In [130]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
              index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [131]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [132]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [133]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [135]:
df.count(axis=1)

a    1
b    2
c    0
d    2
dtype: int64

In [136]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### 5.3.1 相関と共分散

In [139]:
import pandas.io.data as web

In [149]:
all_data = {}
#web.get_data_yahoo('GOOG', '1/1/2010', '1/1/2014')
for ticker in ['AAPL', 'IBM', 'MSFT']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2010', '1/1/2014')

In [150]:
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.iteritems()})

In [151]:
# 株価のパーセント変化
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT
Date
2013-12-24 -0.004245  0.005433  0.012562
2013-12-26 -0.006641  0.011625  0.009709
2013-12-27 -0.006756 -0.001457 -0.004006
2013-12-30 -0.009945  0.007186  0.000000
2013-12-31  0.011722  0.006223  0.003218

In [152]:
# 相関
returns.MSFT.corr(returns.IBM)

0.51940726812255256

In [153]:
#共分散
returns.MSFT.cov(returns.IBM)

8.8814511172102917e-05

In [154]:
returns.corr()

          AAPL       IBM      MSFT
AAPL  1.000000  0.406229  0.363282
IBM   0.406229  1.000000  0.519407
MSFT  0.363282  0.519407  1.000000

In [155]:
returns.cov()

          AAPL       IBM      MSFT
AAPL  0.000306  0.000084  0.000091
IBM   0.000084  0.000141  0.000089
MSFT  0.000091  0.000089  0.000207

### 5.3.2 一意な値、頻度の確認、所属の確認

In [156]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [157]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [162]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [163]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [164]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [167]:
data = DataFrame({'Qu1': [1,3,4,3,4], 'Qu2':[2,3,1,2,3], 'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [168]:
# 値の頻度を求める
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## 5.4 欠損値の取り扱い

In [169]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [170]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### 5.4.1 欠損値を除外する

In [2]:
from numpy import nan as NA

In [3]:
data = Series([1, NA, 3.5, NA, 7])

In [4]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [6]:
cleaned = data.dropna()
cleaned

   0    1  2
0  1  6.5  3

In [7]:
# howオプションでallを指定すると、すべてNAの行が削除される
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [9]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [10]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [11]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0  0.976203       NaN       NaN
1  1.080301       NaN       NaN
2  0.933054       NaN       NaN
3 -1.192412       NaN  0.126805
4 -0.074261       NaN  0.256657
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [12]:
# threshオプションで、行のデータ数に閾値を儲けることができる
df.dropna(thresh=3)

          0         1         2
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [13]:
df.dropna(thresh=2)

          0         1         2
3 -1.192412       NaN  0.126805
4 -0.074261       NaN  0.256657
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [14]:
df.dropna()

          0         1         2
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

### 5.4.2 欠損値を穴埋めする

In [15]:
df

          0         1         2
0  0.976203       NaN       NaN
1  1.080301       NaN       NaN
2  0.933054       NaN       NaN
3 -1.192412       NaN  0.126805
4 -0.074261       NaN  0.256657
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [17]:
df.fillna(0)

          0         1         2
0  0.976203  0.000000  0.000000
1  1.080301  0.000000  0.000000
2  0.933054  0.000000  0.000000
3 -1.192412  0.000000  0.126805
4 -0.074261  0.000000  0.256657
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [19]:
# 辞書型を引数に入れれば、列ごとに異なる値でNAの置き換えが出来る
df.fillna({1:0.5, 2:-1})

          0         1         2
0  0.976203  0.500000 -1.000000
1  1.080301  0.500000 -1.000000
2  0.933054  0.500000 -1.000000
3 -1.192412  0.500000  0.126805
4 -0.074261  0.500000  0.256657
5 -0.535649 -0.422481  0.326928
6  1.512014 -0.389586 -0.227026

In [20]:
# 再インデックス付けのときの穴埋め方法がfillnaでも使える
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA
df

          0         1         2
0  0.919063 -0.333146 -1.316448
1  0.295213  0.905479 -1.166960
2  1.697397       NaN -1.262630
3  0.290378       NaN -0.319803
4 -0.137871       NaN       NaN
5  1.743150       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0  0.919063 -0.333146 -1.316448
1  0.295213  0.905479 -1.166960
2  1.697397  0.905479 -1.262630
3  0.290378  0.905479 -0.319803
4 -0.137871  0.905479 -0.319803
5  1.743150  0.905479 -0.319803

In [22]:
# 平均値や中央値で穴埋めもsできる
data = Series([1., NA, 3.5, NA, 7.])

In [23]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 5.5 階層型インデックス

In [24]:
data = Series(np.random.randn(10), 
             index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
             [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -1.820935
   2    1.661385
   3   -0.858701
b  1    0.752988
   2   -1.096317
   3    0.512945
c  1   -0.119353
   2   -1.928254
d  2   -0.778603
   3   -2.144740
dtype: float64

In [25]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [26]:
data['b']

1    0.752988
2   -1.096317
3    0.512945
dtype: float64

In [28]:
data.ix[['b', 'd']]

b  1    0.752988
   2   -1.096317
   3    0.512945
d  2   -0.778603
   3   -2.144740
dtype: float64

In [29]:
data[:, 2]

a    1.661385
b   -1.096317
c   -1.928254
d   -0.778603
dtype: float64

In [30]:
data.unstack()

          1         2         3
a -1.820935  1.661385 -0.858701
b  0.752988 -1.096317  0.512945
c -0.119353 -1.928254       NaN
d       NaN -0.778603 -2.144740

In [32]:
frame = DataFrame(np.arange(12).reshape((4,3)), 
                 index=[['a', 'a', 'b', 'b'], [1,2,1,2]], 
                 columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [33]:
frame.index.names=['key1', 'key2']
frame.columns.names=['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### 5.5.1 階層の順序変更とソート

In [34]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [37]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [38]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 5.5.2 階層ごとの要約統計量

In [40]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [41]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 5.5.3 データフレームの列をインデックスに使う

In [42]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1), 
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                  'd': [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [43]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [44]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

## 5.6 pandasのその他のトピック
### 5.6.1 整数を使ったインデックス参照

In [45]:
ser = Series(np.arange(3.))
ser

0    0
1    1
2    2
dtype: float64

In [47]:
# error
#ser[-1]

In [48]:
ser2 =Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [49]:
ser[1]

1.0

In [50]:
ser2

a    0
b    1
c    2
dtype: float64

In [51]:
ser2[1]

1.0